{"modelTopology": {"keras_version": "2.0.4", "backend": "tensorflow", "model_config": {"config": [{"config": {"trainable": true, "bias_constraint": null, "batch_input_shape": [null, 13], "use_bias": true, "activation": "relu", "units": 20, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_13", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "trainable": true, "units": 10, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_14", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "bias_constraint": null, "use_bias": true, "trainable": true, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_15", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"loss_weights": null, "loss": "mean_squared_error", "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "epsilon": 1e-08, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "metrics": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_13/kernel", "shape": [13, 20], "dtype": "float32"}, {"name": "dense_13/bias", "shape": [20], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "dense_14/kernel", "shape": [20, 10], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "dense_15/kernel", "shape": [10, 1], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [1], "dtype": "float32"}]}]}