{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_10/kernel", "shape": [13, 20], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [20], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "dense_11/kernel", "shape": [20, 10], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "dense_12/kernel", "shape": [10, 1], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [1], "dtype": "float32"}]}]}